#ifndef _GEN
#define _GEN
#include "Node.hpp"
#include "Tree.hpp"
#include <fstream>

/// Класът се използва за рекурсивно създаване на кореново дърво от елементи

class Generator
{
public:
    /// Създава построеното кореново дърво
    /// @param fstream файл
    /// @returns Tree кореново дърво
    static Tree GenerateTree(std::fstream &in);

    /// Строи кореново дърво чрез рекурсия и връща коренът на дървото
    ///
    /// 1. Взема се ред, за него има два варианта: таг-листо(дъното на рекурсията), таг или да е текст
    ///
    /// 1.1 Ако е таг-листо: създава се този таг и се връща като резултат
    ///
    /// 1.2 Ако е таг: създава се конкретният таг и в листа с вложените елементи(childs) се добавя резултата от рекурсивното извикване на ф-ята за i+1
    ///
    /// 1.3 Ако е текст: добавя се към текста на конкретния елемент
    /// @param vector<string> от редовете във файла
    /// @param size_t индекс, указващ низ-а във вектора
    /// @returns Node коренът на дървото
    /// Алгоритъмът за строене е следният:
    static Node TreeGenerator(const std::vector<std::string> &content, size_t &i);
};

#endif